Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of telmate/proxmox from the dependency lock file
- Using previously-installed telmate/proxmox v3.0.1-rc3

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_lxc.test_atlantis will be created
  + resource "proxmox_lxc" "test_atlantis" {
      + arch         = "amd64"
      + cmode        = "tty"
      + console      = true
      + cores        = 2
      + cpulimit     = 0
      + cpuunits     = 1024
      + hostname     = "test-lxc"
      + id           = (known after apply)
      + memory       = 512
      + onboot       = false
      + ostemplate   = "local:vztmpl/debian-11-standard_11.0-1_amd64.tar.gz"
      + ostype       = (known after apply)
      + protection   = false
      + start        = false
      + swap         = 512
      + tags         = (known after apply)
      + target_node  = "pve"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 109

      + features {
          + fuse    = false
          + keyctl  = false
          + mknod   = false
          + nesting = true
        }

      + network {
          + bridge = "vmbr0"
          + hwaddr = (known after apply)
          + id     = (known after apply)
          + ip     = "dhcp"
          + name   = "eth0"
          + tag    = (known after apply)
          + trunks = (known after apply)
          + type   = (known after apply)
        }
      + network {
          + bridge = "vmbr1"
          + hwaddr = (known after apply)
          + id     = (known after apply)
          + ip     = "10.0.1.109/24"
          + name   = "eth1"
          + tag    = (known after apply)
          + trunks = (known after apply)
          + type   = (known after apply)
        }

      + rootfs {
          + size    = "4G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://10.0.1.108:80/lock?id=kareemlukitomo%252Fhomelab-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```